#include <stdio.h> // เป็นไลบรารีมาตรฐานที่จำเป็นสำหรับการรับและแสดงผลข้อมูล

int main() {  // ประกาศตัวแปรชนิด float (จำนวนจริงมีทศนิยม) สำหรับเก็บตัวเลข x และ y
    float x, y;

    printf("Please enter a number for x: ");  // แสดงข้อความเพื่อบอกให้ผู้ใช้ป้อนค่าสำหรับ x , รับค่าตัวเลขทศนิยมจากผู้ใช้และเก็บไว้ในตัวแปร x
    scanf("%f", &x);  // %f ใช้สำหรับรับค่า float, &x คือตำแหน่งของตัวแปร x

    printf("Please enter a number for y: ");  // แสดงข้อความเพื่อบอกให้ผู้ใช้ป้อนค่าสำหรับ y , รับค่าตัวเลขทศนิยมจากผู้ใช้และเก็บไว้ในตัวแปร y
    scanf("%f", &y);

    // ส่วนของการเปรียบเทียบค่าและแสดงผลลัพธ์ 
    if (x > y) {  // ตรวจสอบเงื่อนไขแรก: ถ้า x มากกว่า y , แสดงผลลัพธ์ว่า x มากกว่า y
        printf("%.2f is greater than %.2f\n", x, y);  // %.2f คือการแสดงค่า float ให้มีทศนิยม 2 ตำแหน่ง
    }
    else if (x < y) {  // ตรวจสอบเงื่อนไขที่สอง (ถ้าเงื่อนไขแรกเป็นเท็จ): ถ้า x น้อยกว่า y , แสดงผลลัพธ์ว่า x น้อยกว่า y
        printf("%.2f is less than  %.2f\n", x, y);
    }
    // ถ้าไม่ใช่ทั้งสองเงื่อนไขข้างต้น (คือ x ไม่ได้มากกว่า y และ x ไม่ได้น้อยกว่า y)
    // แสดงว่า x ต้องเท่ากับ y

    else {
        printf("%.2f is equal to  %.2f\n", x, y);   // แสดงผลลัพธ์ว่า x เท่ากับ y
    }

    return 0;  // คืนค่า 0 เพื่อบอกว่าโปรแกรมทำงานเสร็จสิ้น
}